client-keeper/app/controllers/clients_controller.rb

    def index
        render json: Client.all
---
SELECT "clients".* FROM "clients"

    def show
        puts params
        render json: Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]